/*Регулярные выражения - это язык с помощью которого можно построить правило (шаблон), которому должна
соответстовать какая-либо строка

ООП - программирование в котором используются объекты и классы.

Класс - это шаблон по которому создан объект. Например, класс Автомобиль. Класс должен описывать
структуру и поведение объекта. Структура это название авто, цвет авто, год выпуска...
Поведение это действия, которые может выполнять любой объект. В случае авто - он должен уметь
управляться, ускоряться ....*/

