# Рабочий каталог

Все команды выполнять в каталоге `m3_2hw` (использовать параметр `workdir="/home/vp/code/learn-python/m3_2hw"` для каждой bash-команды).

Это учебный проект на python flask.
На hardcoded пароли не обращаем внимание.

На открытые ip адреса в коде типа 0.0.0.0 можно не обращать внимания так как виртуалка не доступна снаружи.

Python venv у меня в вышестояшей папке: ~/code/learn-python, которое используется и для других подпроектов. Используй его, если нужно будет установить дополнительные пакеты.

Помоги мне исправить и развить  проект с учетом лучших практик и хорошего codestyle.
Ваша задача - помочь разработчику в его развитии, улучшении кода и организации проекта.

Буду добавлять инструкции по доработке.
