
cart = []

MENU = f"""{'*'*100}
1) Показать товары каталога\n2) Добавить товар в каталог\n3) Удалить товар из каталога
4) Изменить стоимость товара\n5) Добавить товар в корзину покупок\n6) Вывести корзину\n7) Выход\n{'*'*100}\n
"""


admins = [
    {
        'username':'admin',
        'password':'123',
    },
    {
        'username':'root',
        'password':'321'
    }
]

products = [
    {
        'id':1,
        'title':'Audi',
        'price':1000
    },
    {
        'id':2,
        'title':'BMW',
        'price':1500
    },
    {
        'id':3,
        'title':'VW',
        'price':900
    }
]
