def get_sum(a,b):
    return a-b

calc = lambda a,b: a+b


print(calc(2,3))

# Создать консольный калькулятор для 4ех действий: +,-,*,/. Если при делении в знаменателе 0, то вернем -1
# и выведем сообщение, что на 0 делить нельзя.
# Создать отдельную функцию для каждого знака. Создать функцию calc(a,b,sign). На основе знака операции
# sign вычислить результат. В функции calc необходимо использовать ранее написанные 4 функции.
#