--- для cli утилиты.

/* cd /home/vp/code/learn-python/m3_5_lab/.infra/db/postgres-db-init/init-scripts \
    && docker exec -i postgres-learn-py psql -U postgres -d postgres < init-cli.sql
*/

-- ============================================================================
-- Настройки безопасности (Падаем при первой же ошибке!)
-- ============================================================================
\set ON_ERROR_STOP on

-- ============================================================================
-- Объявление переменных psql
-- ============================================================================
\set db_name 'm3_5_lab'
\set db_user 'lab_admin'
\set db_pass 'admin'

-- ============================================================================
-- Работаем в системной базе (создаем пользователя и саму БД)
-- ============================================================================

-- Идемпотентно создаем пользователя через \gexec
SELECT
    format(
        'CREATE USER %I WITH PASSWORD %L;',
        :'db_user', --noqa
        :'db_pass' --noqa
    )
WHERE NOT EXISTS (
    SELECT FROM pg_catalog.pg_roles WHERE rolname = :'db_user' --noqa
) \gexec

\echo 'Пользователь ' :db_user ' успешно добавлен или обновлен'

-- Идемпотентно создаем базу данных
SELECT
    format(
        'CREATE DATABASE %I OWNER %I;',
        :'db_name', --noqa
        :'db_user' --noqa
    )
WHERE NOT EXISTS (
    SELECT FROM pg_database WHERE datname = :'db_name' --noqa
) \gexec

\echo 'База данных ' :db_name ' готова к работе'

-- ============================================================================
-- Переключаемся в созданную базу
-- ============================================================================
\c :db_name
\echo 'Успешно переключились на базу данных ' :db_name

-- ============================================================================
-- Настройка прав ВНУТРИ новой базы
-- ============================================================================

-- Выдаем права на схему public
SELECT format(
    'GRANT ALL ON SCHEMA public TO %I; ALTER SCHEMA public OWNER TO %I;',
    :'db_user', --noqa
    :'db_user' --noqa
) \gexec

\echo 'Инициализация полностью завершена!'
