# Вариант №1
# if условие_1:
#     блок с инструкциями
# elif условие_2:
#     блок с инструкциями
# elif условие_3:
#     блок с инструкциями
# else:
#     блок с инструкциями запустится лишь в случае, если ни одно условие выше не дало нам True

# Вариант №2
# if условие1:
#     действия_1
# if условие2:
#     действия2

# Пример

# x = True
# Для сравнения значения переменной на True вместо:
# if x == True:
#     print()

# ИСПОЛЬЗУЙТЕ:
# if x: #проверка на True
#     print()

# Для сравнения переменной с False вместо:
# if x == False:
#     print('x is false')
#
# используйте:
# if not x: #проверка на False
#     print('x is true')



# age = input("Введите возраст\n")
# if(age.isdigit()):
#     age = int(age)
#     # if age >= 0 and age <= 100:
#     if 0 <= age <= 100:
#         print("Возраст корректный")
#     else:
#         print("Введенное значение выходит за рамки отрезка")
# else:
#     print("Вы ввели нечисло!")
#
# print(age)

