# # Кириллица: [а-яА-ЯёЁ]
# # Только числа: [0-9] или \d
# # Всё кроме цифр: [^0-9] или \D
# # [a-z0-9_] или \w
# # \s - пробелы, табы...
# import re
#
# # Мы используем рег. выражения для трех целей: поиск, замена и проверка соответствия
#
# # txt = """
# #     Ауди стоит 1000 у.е.
# #     БМВ стоит 1200 у.е.
# #     VW стоит 900 у.е.
# # """
#
# # Пример на поиск
# # print(re.compile(r"\d+").findall(txt))
#
# # Пример на замену
# # rule = re.compile(r"\d+")
# # print(rule.sub("...",txt))
#
# email = "demo@mail.ru"
#
# rule_email = r"^[a-z0-9_-]+@[a-z0-9_-]+\.[a-z]{2,5}$"
# rule_email_v2 = r"^[\w-]+@[\w-]+\.[a-z]{2,5}$"
#
# print("email корректный" if re.match(rule_email_v2,email) else "email некорректный")
#
# # Создать шаблон для проверки номера телефона на соответсвие:
# # +7(9NN)NNN-NN-NN
import re

rule_num = r"^\+7\(9\d{2}\)\d{3}\-\d{2}-\d{2}$"
rule_num2 = r"^\+7\(9\d{2}\)\d{3}(-\d{2}){2}$"
print("телефон корректный" if re.match(rule_num,'+7(911)111-11-11') else "телефон некорректный")