# Есть встроенные базовые математические функции
# 1) Функции max, min
# print(max(2,7,3))

# 2) Округление чисел
# round() - округление по правилам математики
# round(число) - выполняем округление до целого значения
# round(число,до какого знака округляем)
# print(round(25.476,2)) #25.48
# print(round(25.476))  #25

# Для получения доступа к дополнительным математическим функциям используйте модуль math

import math

# print(math.ceil(2.0001)) #3
# print(math.floor(2.9999)) #2
# print(math.sqrt(9)) #корень квадратный из 3
# print(math.fabs(-10)) #10

# age1,age2 = input('Введите возраст1\n'),input('Введите возраст2\n')
# print("Разница в возрасте:",int(math.fabs(int(age1) - int(age2))))
# print(math.pi)





